Repository: xs08/FloderSync
Catalog: Resources/Automation.xcstrings
Source language: en
Languages: zh_hans

# automation.autoCommit
source: Automatic Commit
zh_hans: 自动提交

# automation.autoCommit.disabled
source: Off
zh_hans: 关闭

# automation.autoCommit.email
source: Author Email
zh_hans: 提交者邮箱

# automation.autoCommit.email.placeholder
source: Use Git configuration
zh_hans: 使用 Git 配置

# automation.autoCommit.enabled
source: On
zh_hans: 开启

# automation.autoCommit.identity.help
source: Leave blank to use the repository or global Git user.name and user.email.
zh_hans: 留空时使用仓库或 Git 全局配置中的 user.name 与 user.email。

# automation.autoCommit.message
source: Commit Message
zh_hans: 提交信息

# automation.autoCommit.message.help
source: Use fixed text or insert ${user}, ${email}, and ${time}.
zh_hans: 可使用固定文本，或插入 ${user}、${email}、${time}。

# automation.autoCommit.message.placeholder
source: FloderSync: automatic sync at ${time}
zh_hans: FloderSync：${time} 自动同步

# automation.autoCommit.messageRequired
source: Enter a commit message before enabling automatic commit.
zh_hans: 开启自动提交前，请填写提交信息。

# automation.autoCommit.user
source: Author Name
zh_hans: 提交者名称

# automation.autoCommit.user.placeholder
source: Use Git configuration
zh_hans: 使用 Git 配置

# automation.daily
source: Daily Times
zh_hans: 每日定时

# automation.daily.add
source: Add Time
zh_hans: 添加时间

# automation.daily.off
source: No daily sync times
zh_hans: 未设置每日同步时间

# automation.daily.remove
source: Remove daily time
zh_hans: 移除每日时间

# automation.daily.time
source: Sync time
zh_hans: 同步时间

# automation.delay.1minute
source: 1 minute
zh_hans: 1 分钟

# automation.delay.5seconds
source: 5 seconds
zh_hans: 5 秒

# automation.delay.10seconds
source: 10 seconds
zh_hans: 10 秒

# automation.duration.custom
source: Custom
zh_hans: 自定义

# automation.empty.message
source: Add a repository before configuring automation.
zh_hans: 添加仓库后才能配置自动同步。

# automation.fileChanges
source: Sync after file changes
zh_hans: 文件变化同步

# automation.fileChanges.customSeconds
source: Quiet for %d seconds
zh_hans: 静默 %d 秒

# automation.fileChanges.delay
source: Quiet period
zh_hans: 静默延迟

# automation.integration
source: Remote integration
zh_hans: 远端整合

# automation.integration.merge.description
source: Preserves both histories and may create a merge commit.
zh_hans: 保留两侧历史，必要时会创建合并提交。

# automation.integration.rebase
source: Rebase (Recommended)
zh_hans: Rebase（推荐）

# automation.integration.rebase.description
source: Replays local commits on the latest remote history to keep it linear.
zh_hans: 将本地提交应用到远端最新历史之后，保持提交记录线性。

# automation.interval
source: Repeat
zh_hans: 重复间隔

# automation.interval.1hour
source: Every hour
zh_hans: 每 1 小时

# automation.interval.5minutes
source: Every 5 minutes
zh_hans: 每 5 分钟

# automation.interval.10minutes
source: Every 10 minutes
zh_hans: 每 10 分钟

# automation.interval.customMinutes
source: Every %d minutes
zh_hans: 每 %d 分钟

# automation.interval.hours
source: Every %d hours
zh_hans: 每 %d 小时

# automation.interval.minutes
source: Every %d minutes
zh_hans: 每 %d 分钟

# automation.interval.off
source: Off
zh_hans: 关闭

# automation.repository.section
source: Automatic Sync
zh_hans: 自动同步

# automation.repositoryDisabled
source: Automatic sync disabled
zh_hans: 自动同步已停用

# automation.rule.add
source: Add Rule
zh_hans: 添加规则

# automation.rule.configuration
source: Sync Configuration
zh_hans: 同步配置

# automation.rule.defaultName
source: Rule %d
zh_hans: 规则 %d

# automation.rule.edit
source: Edit Rule
zh_hans: 编辑规则

# automation.rule.identity
source: Rule
zh_hans: 规则

# automation.rule.inUse
source: This rule is used by repositories and cannot be removed without detaching them.
zh_hans: 该规则正被仓库使用，解除引用前无法删除。

# automation.rule.missing
source: The selected rule is missing. Automatic sync is paused for this repository.
zh_hans: 选中的规则不存在，当前仓库的自动同步已暂停。

# automation.rule.name
source: Rule name
zh_hans: 规则名称

# automation.rule.nameDuplicate
source: Rule names must be unique.
zh_hans: 规则名称不能重复。

# automation.rule.nameRequired
source: Enter a rule name.
zh_hans: 请输入规则名称。

# automation.rule.remove
source: Remove Rule
zh_hans: 删除规则

# automation.rule.remove.confirm.title
source: Remove this rule?
zh_hans: 删除这条规则？

# automation.rule.remove.confirm.unused
source: The rule is not used by any repository.
zh_hans: 当前没有仓库使用这条规则。

# automation.rule.remove.confirm.used
source: %d repositories will keep an independent copy of this configuration.
zh_hans: %d 个仓库将保留一份独立的自定义配置。

# automation.rule.repositories
source: Used By
zh_hans: 使用此规则的仓库

# automation.rule.repositories.none
source: No repositories use this rule yet.
zh_hans: 尚无仓库使用这条规则。

# automation.rule.save
source: Save Rule
zh_hans: 保存规则

# automation.rule.saveImpact
source: Changes affect %d repositories.
zh_hans: 更改会影响 %d 个仓库。

# automation.rule.select
source: Select an automation rule
zh_hans: 选择一条自动化规则

# automation.rule.shared
source: Shared rule
zh_hans: 共享规则

# automation.rule.triggerRequired
source: Enable at least one sync trigger.
zh_hans: 请至少启用一种同步触发条件。

# automation.rule.usage
source: Used by %d repositories
zh_hans: %d 个仓库正在使用

# automation.rules.empty.message
source: Create a reusable rule, then apply it from a repository.
zh_hans: 创建可复用规则，然后在仓库中应用。

# automation.rules.empty.title
source: No Automation Rules
zh_hans: 暂无自动化规则

# automation.source
source: Configuration source
zh_hans: 配置来源

# automation.source.custom
source: Custom for this repository
zh_hans: 当前仓库自定义

# automation.source.useCustom
source: Use Custom Configuration
zh_hans: 改用自定义配置

# automation.summary.fileChanges
source: File changes after %d seconds
zh_hans: 文件停止变化 %d 秒后

# automation.summary.interval
source: Every %d minutes
zh_hans: 每 %d 分钟

# automation.summary.triggers
source: Triggers
zh_hans: 触发条件
